Revit 2024 API
LoadOrientTo Enumeration
 Specifies load orientation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Since: 2015
Syntax
C#
public enum LoadOrientTo
Visual Basic
Public Enumeration LoadOrientTo
Visual C++
public enum class LoadOrientTo
Members
Member name | Description
Project |  Load is oriented in respect to project global coordinate system, that is X to East, Y to North, and Z to up.
WorkPlane |  Load is oriented in respect to work plane.
HostLocalCoordinateSystem |  Load is oriented in respect to it analytical host element coordinate system and will follow host changes.
See Also
Autodesk.Revit.DB.Structure Namespace